const allEquipmentData = [
  {
    type: "long-sword",
    title: "Довгий меч",
    description: [
      "Вершина розвитку фехтування. Наша школа починалася саме з фехтування довгим мечем. Довгий меч лицарським мечем не вважається. Він ним є.",
      "Повна броня дозволила відмовитися від використання щита і взяти меч двома руками. Згодом, набувши складних переходів від атаки до захисту, фехтування лонгсвордом розвинулося до рівня, що зробило непотрібним носіння броні в мирному житті. Саме тоді фехтування довгим мечем стало справжнім мистецтвом.",
    ],
    imgsSrcs: [
      "/imgs/equipment/long-sword/img-1.png",
      "/imgs/equipment/long-sword/img-2.png",
      "/imgs/equipment/long-sword/img-3.png",
    ],
  },
  {
    type: "sword",
    title: "Меч",
    description: [
      "Фехтування як мистецтво починається саме з меча. Мечем фехтують як самостійно, так і в парі з щитом-тарчем, малим щитом-баклером, а на вищих рівнях школи - і парними мечами.",
      "Меч недарма овіяний романтичним флером. Історично це статусна зброя воїна. В школі Зелена гілка в основному використовуються два типи меча: каролінгський та романський.",
      "Каролінгський - меч династії Каролінгів, загальноєвропейського типу, був розповсюджений від Іспанії до Скандинавії та Київської Русі. Романський меч вважається суто лицарським мечем, хоча він просто подальший розвиток каролінгського, відрізняється трохи подовженим руків'ям та незначно зміненою формою леза.",
    ],
    imgsSrcs: [
      "/imgs/equipment/sword/img-1.png",
      "/imgs/equipment/sword/img-2.png",
      "/imgs/equipment/sword/img-3.png",
    ],
  },
  {
    type: "espada",
    title: "Еспада",
    description: [
      "Легкий меч з акцентом на удари вістрям. Назва походить від латинського слова spatha, назви римського кавалерійського меча. Еспада в парі з дагою є однією з вершин фехтувального мистецтва, не поступаючись лонгсворду.",
      `Еспада рапера (espada ropera) означає "меч для костюма", тобто це зброя для повсякденного носіння. Після відмови від даги (на користь зручності носіння) мистецтво фехтування рапірою покотилося вниз, у спорті майже повністю втративши зв'язок з реальністю.`,
    ],
    imgsSrcs: [
      "/imgs/equipment/espada/img-1.png",
      "/imgs/equipment/espada/img-2.png",
      "/imgs/equipment/espada/img-3.png",
    ],
  },
  {
    type: "saber",
    title: "Шабля",
    description: [
      "Національний символ козацтва, один з основних видів клинкової зброї як піхотинця, так і вершника. Фехтування відбувається круговими рухами з протягуванням клинка. Клинок закручується колами, атакуючи з найнесподіваніших напрямків. Це дуже красивий і ефективний (а не тільки ефектний) танок.",
      `Окремої зброї під назвою "козацька шабля" в природі не існує, козаки носили польські, угорські, турецькі та інші шаблі, а шашка - це таки не шабля. Коней в нас теж нема, фехтуємо піші)`,
    ],
    imgsSrcs: [
      "/imgs/equipment/saber/img-1.png",
      "/imgs/equipment/saber/img-2.png",
      "/imgs/equipment/saber/img-3.png",
    ],
  },
  {
    type: "spear",
    title: "Спис",
    description: [
      `Спис та інша древкова зброя (топор, сокира, алебарда). Спис - це перша зброя людства. Спис - це головна зброя поля бою. Як казали давні германці, "один спис вартий двох мечів". Саме спис на озброєнні піхотинців зупинив переможний розбіг важкої лицарської кінноти, теж, до речі, озброєної списами-ленсами. І так, списом фехтують.`,
    ],
    imgsSrcs: [
      "/imgs/equipment/spear/img-1.png",
      "/imgs/equipment/spear/img-2.png",
      "/imgs/equipment/spear/img-3.png",
    ],
  },
  {
    type: "unarmed",
    title: "Бій без зброї",
    description: [
      "Бій без озброєння в школі Зелена гілка не є самостійною дисципліною. Але оскільки фехтувальник не має лишатися безпорадним у випадку, коли в нього немає можливості скористатися зброєю, в школі існує техніка ББО.",
      "Основою техніки є ті самі фехтувальні рухи атаки та захисту, але з адаптацією під відсутність меча. Також удари ногами та кидки в старовинних школах фехтування існували паралельно до дій зброєю.",
    ],
    imgsSrcs: [
      "/imgs/equipment/unarmed/img-1.png",
      "/imgs/equipment/unarmed/img-2.png",
      "/imgs/equipment/unarmed/img-3.png",
    ],
  },
];


const getCurrentEquipmentData = () => {
  const pathname = window.location;
  const searchParams = pathname.search.split("=");
  const nedeedData = allEquipmentData.filter((el) => el.type == searchParams[1]);

  const readyMadeHTML = `
   <h1 class="content_title">${nedeedData[0].title}</h1>

   <div class="content_process-gallery">
    ${nedeedData[0].imgsSrcs.map((src) => (
      `<img src="${src}" />`
    )).join("")}
   </div>

   <div class="content_text-block">
    <div class="text-blok_description">
      ${nedeedData[0].description.map((el) => `<p>${el}</p>`).join("")}
    </div>

    <div class="text-block_gta-card">
      <img src="/imgs/icons/post.svg" class="gta-card_ico" />
      <h4 class="gta-card_title">Хочете спробувати?</h4>
      <p class="gta-card_text">
       Запишіться на пробне заняття - перший крок у світ старовинного фехтування.
      </p>
      <a href="https://t.me/zelenaGilkaPereplutie#" class="gta-card_link">Записатись на пробне заняття</a>
    </div>
   </div>
  `;

  return readyMadeHTML;
};

const mainBlock = document.querySelector(".main_content");
mainBlock.innerHTML = getCurrentEquipmentData();